---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAngleUsage
source: html/846e530e-49de-308b-fd72-c3414b3e5257.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAngleUsage Property

Determine how to use fitting angle during pipe layout or modifying layout.

## Syntax (C#)
```csharp
public FittingAngleUsage FittingAngleUsage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for fittingAngleUsage doesn't support in piping.
 -or-
 When setting this property: A value passed for an enumeration argument is not a member of that enumeration